Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D21.svd
            <register>
               <name>TXBCF</name>
               <description>Transmit Buffer Cancellation Finished Register</description>
               <addressOffset>0xDC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CF0</name>
                     <description>Cancellation Finished for Transmit Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF1</name>
                     <description>Cancellation Finished for Transmit Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF2</name>
                     <description>Cancellation Finished for Transmit Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF3</name>
                     <description>Cancellation Finished for Transmit Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF4</name>
                     <description>Cancellation Finished for Transmit Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF5</name>
                     <description>Cancellation Finished for Transmit Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF6</name>
                     <description>Cancellation Finished for Transmit Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF7</name>
                     <description>Cancellation Finished for Transmit Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF8</name>
                     <description>Cancellation Finished for Transmit Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF9</name>
                     <description>Cancellation Finished for Transmit Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF10</name>
                     <description>Cancellation Finished for Transmit Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF11</name>
                     <description>Cancellation Finished for Transmit Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF12</name>
                     <description>Cancellation Finished for Transmit Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF13</name>
                     <description>Cancellation Finished for Transmit Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF14</name>
                     <description>Cancellation Finished for Transmit Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF15</name>
                     <description>Cancellation Finished for Transmit Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF16</name>
                     <description>Cancellation Finished for Transmit Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF17</name>
                     <description>Cancellation Finished for Transmit Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF18</name>
                     <description>Cancellation Finished for Transmit Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF19</name>
                     <description>Cancellation Finished for Transmit Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF20</name>
                     <description>Cancellation Finished for Transmit Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF21</name>
                     <description>Cancellation Finished for Transmit Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF22</name>
                     <description>Cancellation Finished for Transmit Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF23</name>
                     <description>Cancellation Finished for Transmit Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF24</name>
                     <description>Cancellation Finished for Transmit Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF25</name>
                     <description>Cancellation Finished for Transmit Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF26</name>
                     <description>Cancellation Finished for Transmit Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF27</name>
                     <description>Cancellation Finished for Transmit Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF28</name>
                     <description>Cancellation Finished for Transmit Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF29</name>
                     <description>Cancellation Finished for Transmit Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF30</name>
                     <description>Cancellation Finished for Transmit Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CF31</name>
                     <description>Cancellation Finished for Transmit Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBTIE</name>
               <description>Transmit Buffer Transmission Interrupt Enable Register</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TIE0</name>
                     <description>Transmission Interrupt Enable for Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE1</name>
                     <description>Transmission Interrupt Enable for Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE2</name>
                     <description>Transmission Interrupt Enable for Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE3</name>
                     <description>Transmission Interrupt Enable for Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE4</name>
                     <description>Transmission Interrupt Enable for Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE5</name>
                     <description>Transmission Interrupt Enable for Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE6</name>
                     <description>Transmission Interrupt Enable for Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE7</name>
                     <description>Transmission Interrupt Enable for Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE8</name>
                     <description>Transmission Interrupt Enable for Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE9</name>
                     <description>Transmission Interrupt Enable for Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE10</name>
                     <description>Transmission Interrupt Enable for Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE11</name>
                     <description>Transmission Interrupt Enable for Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE12</name>
                     <description>Transmission Interrupt Enable for Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE13</name>
                     <description>Transmission Interrupt Enable for Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE14</name>
                     <description>Transmission Interrupt Enable for Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE15</name>
                     <description>Transmission Interrupt Enable for Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE16</name>
                     <description>Transmission Interrupt Enable for Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE17</name>
                     <description>Transmission Interrupt Enable for Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE18</name>
                     <description>Transmission Interrupt Enable for Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE19</name>
                     <description>Transmission Interrupt Enable for Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE20</name>
                     <description>Transmission Interrupt Enable for Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE21</name>
                     <description>Transmission Interrupt Enable for Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE22</name>
                     <description>Transmission Interrupt Enable for Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE23</name>
                     <description>Transmission Interrupt Enable for Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE24</name>
                     <description>Transmission Interrupt Enable for Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE25</name>
                     <description>Transmission Interrupt Enable for Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE26</name>
                     <description>Transmission Interrupt Enable for Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE27</name>
                     <description>Transmission Interrupt Enable for Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE28</name>
                     <description>Transmission Interrupt Enable for Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE29</name>
                     <description>Transmission Interrupt Enable for Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE30</name>
                     <description>Transmission Interrupt Enable for Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIE31</name>
                     <description>Transmission Interrupt Enable for Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
