Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMA5D2_DFP/1.9.106/svd/ATSAMA5D21.svd
            <register>
               <name>OSCUPD</name>
               <description>PWM Output Selection Clear Update Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>OSCUPH0</name>
                     <description>Output Selection Clear for PWMH output of the channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH1</name>
                     <description>Output Selection Clear for PWMH output of the channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH2</name>
                     <description>Output Selection Clear for PWMH output of the channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPH3</name>
                     <description>Output Selection Clear for PWMH output of the channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL0</name>
                     <description>Output Selection Clear for PWML output of the channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL1</name>
                     <description>Output Selection Clear for PWML output of the channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL2</name>
                     <description>Output Selection Clear for PWML output of the channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OSCUPL3</name>
                     <description>Output Selection Clear for PWML output of the channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FMR</name>
               <description>PWM Fault Mode Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPOL</name>
                     <description>Fault Polarity</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FMOD</name>
                     <description>Fault Activation Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FFIL</name>
                     <description>Fault Filtering</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSR</name>
               <description>PWM Fault Status Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FIV</name>
                     <description>Fault Input Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FS</name>
                     <description>Fault Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCR</name>
               <description>PWM Fault Clear Register</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FCLR</name>
                     <description>Fault Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPV1</name>
               <description>PWM Fault Protection Value Register 1</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPVH0</name>
                     <description>Fault Protection Value for PWMH output on channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH1</name>
                     <description>Fault Protection Value for PWMH output on channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH2</name>
                     <description>Fault Protection Value for PWMH output on channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVH3</name>
                     <description>Fault Protection Value for PWMH output on channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL0</name>
                     <description>Fault Protection Value for PWML output on channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL1</name>
                     <description>Fault Protection Value for PWML output on channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL2</name>
                     <description>Fault Protection Value for PWML output on channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPVL3</name>
                     <description>Fault Protection Value for PWML output on channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPE</name>
               <description>PWM Fault Protection Enable Register</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPE0</name>
                     <description>Fault Protection Enable for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE1</name>
                     <description>Fault Protection Enable for channel 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE2</name>
                     <description>Fault Protection Enable for channel 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FPE3</name>
                     <description>Fault Protection Enable for channel 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>ELMR[%s]</name>
               <description>PWM Event Line 0 Mode Register</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSEL0</name>
                     <description>Comparison 0 Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL1</name>
                     <description>Comparison 1 Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL2</name>
                     <description>Comparison 2 Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL3</name>
                     <description>Comparison 3 Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL4</name>
                     <description>Comparison 4 Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL5</name>
                     <description>Comparison 5 Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL6</name>
                     <description>Comparison 6 Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CSEL7</name>
                     <description>Comparison 7 Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSPR</name>
               <description>PWM Spread Spectrum Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SPRD</name>
                     <description>Spread Spectrum Limit Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SPRDM</name>
                     <description>Spread Spectrum Counter Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSPUP</name>
               <description>PWM Spread Spectrum Update Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SPRDUP</name>
                     <description>Spread Spectrum Limit Value Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMMR</name>
               <description>PWM Stepper Motor Mode Register</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GCEN0</name>
                     <description>Gray Count Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GCEN1</name>
                     <description>Gray Count Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DOWN0</name>
                     <description>Down Count</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DOWN1</name>
                     <description>Down Count</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPV2</name>
               <description>PWM Fault Protection Value 2 Register</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FPZH0</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH1</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH2</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZH3</name>
                     <description>Fault Protection to Hi-Z for PWMH output on channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL0</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL1</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL2</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPZL3</name>
                     <description>Fault Protection to Hi-Z for PWML output on channel 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPCR</name>
               <description>PWM Write Protection Control Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>WPCMD</name>
                     <description>Write Protection Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WPCMDSelect</name>
                        <enumeratedValue>
                           <name>DISABLE_SW_PROT</name>
                           <description>Disables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_SW_PROT</name>
                           <description>Enables the software write protection of the register groups of which the bit WPRGx is at '1'.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE_HW_PROT</name>
                           <description>Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WPRG0</name>
                     <description>Write Protection Register Group 0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG1</name>
                     <description>Write Protection Register Group 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG2</name>
                     <description>Write Protection Register Group 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG3</name>
                     <description>Write Protection Register Group 3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG4</name>
                     <description>Write Protection Register Group 4</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPRG5</name>
                     <description>Write Protection Register Group 5</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0</description>
                           <value>0x50574D</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
